#+TITLE: Clumped Isotope R Workflow
#+AUTHOR: Ilja J. Kocken
#+EMAIL: i.j.kocken@uu.nl
written by Ilja J. Kocken [[https://orcid.org/0000-0003-2196-8718][orcid:0000-0003-2196-8718]]

#+OPTIONS: ^:{} todo:nil

#+PROPERTY: header-args:R  :session *R:one_ring* :exports both :results output :eval no-export

***** DONE figure out how to get the error message working with null na
CLOSED: [2020-04-16 Thu 12:32]
#+begin_src R
  fun <- function(str) {
    outstr <- ifelse(is.null(str) || is.na(str), 'no group', paste0('WERKT ', str))
    outstr
    glue::glue("dit is de output {outstr}")
  }

  fun("hoi")
  fun(NA)
  fun(NULL)

  x <- "hoi"
  fun(x)
  y <- NULL
  fun(y)
  y <- NA
  fun(y)
#+end_src

#+RESULTS:
: dit is de output WERKT hoi
: dit is de output no group
: dit is de output no group
: dit is de output WERKT hoi
: dit is de output no group
: dit is de output no group

